backend/app/Http/Controllers/AdminController.php

select count(*) as aggregate from `users` where `shortlist` = 1
select count(*) as aggregate from `admins`
select count(*) as aggregate from `programmes`
select count(*) as aggregate from `users`
---
    public function index()
    {
        $user_count = User::count();
        $shortlist_count = User::where('shortlist', 1)->count();
        $admin_count = Admin::count();
        $user_admission_count = UserAdmission::whereNotNull('session')->count();
        $programe_count = Programme::count();

        $studentsPerRegion = DB::table('users')->join('courses', 'users.registered_course', '=', 'courses.id')->select('courses.location as region', DB::raw('count(*) as total'))->whereNotNull('users.registered_course')->groupBy('courses.location')->get();

        $studentsPerCourse = User::select('courses.course_name', DB::raw('count(*) as total'))->leftJoin('courses', 'users.registered_course', '=', 'courses.id')->whereNotNull('registered_course')->groupBy('courses.course_name')->get();

        $studentsPerCourse = $studentsPerCourse->map(function ($item) {
            $parts = explode(' - ', $item->course_name);
            $item->display_name = $parts[0];
            return $item;
        });

        $registrationsPerDay = User::select(DB::raw('DATE(created_at) as date'), DB::raw('count(*) as total'))->groupBy('date')->orderBy('date', 'asc')->limit(30)->get();

select * from `oex_exam_masters`
select * from `oex_exam_masters` where `status` = '1'
select `course_name`, `id` from `courses`
select * from `course_sessions`
---
    public function shortlisted_students(Request $request)
    {
        $data['exam'] = Oex_exam_master::all();
        $data['exams'] = Oex_exam_master::where('status', '1')->get()->toArray();
        $data['courses'] = Course::pluck('course_name', 'id')->toArray();
        $data['sessions'] = CourseSession::courseType()->get();

select * from `courses`
select * from `course_sessions`
---
    public function registered_students()
    {
        $data['users'] = User::select('users.*', 'user_admission.id as admitted', 'courses.course_name', 'course_sessions.name as session_name', 'user_admission.session as session_id', 'courses.id as course_id')->leftJoin('user_admission', 'users.userId', '=', 'user_admission.user_id')->leftJoin('courses', 'user_admission.course_id', '=', 'courses.id')->leftJoin('course_sessions', 'user_admission.session', '=', 'course_sessions.id')->paginate(15);
        $courses = Course::all();
        $sessions = CourseSession::courseType()->get();

select * from `courses`
---
    public function getReportView()
    {
        $courses = Course::all();

select * from `courses`
---
    public function generateReport(Request $request)
    {
        $validated = $request->validate([
            'report_type' => 'required|in:student_summary,course_summary,session_summary',
            'dates' => 'required',
            'course_id' => 'sometimes|array',
            'daily' => 'sometimes|in:yes,no',
            'course_id.*' => 'numeric|min:0',
            'virtual_week' => 'sometimes|array',
            'virtual_week.*' => 'numeric|min:1|max:54',
        ]);

        $startDate = Carbon::parse(explode(' - ', $request->dates)[0]);
        $endDate = Carbon::parse(explode(' - ', $request->dates)[1]);

        $dates = $this->getWeekdays($startDate, $endDate);

        $courses = Course::all();
        $selectedCourse = null;
        $studentAttendanceData = collect();
        $attendanceData = collect();

        $dailyQuery = isset($validated['daily']) && $validated['daily'] == 'yes';

        if (!Str::startsWith($request->get('report_type'), 'student')) {
            // find students that have attendance for the selected dates
            $viewName = $request->get('report_type') == 'course_summary' ? COURSE_ATTENDANCE_VIEW : COURSE_SESSION_ATTENDANCE_VIEW;
            $groupByName = $request->get('report_type') == 'course_summary' ? 'course_name' : 'session_name';
            $groupKey = $request->get('report_type') == 'course_summary' ? 'course_id' : 'session_id';

            $selectName = $request->get('report_type') == 'course_summary' ? 'v1.course_name as name' : 'v1.session_name as name';

select * from `courses` where `courses`.`id` = '25' limit 1
select * from `courses`
---
            $studentAttendanceData = collect(DB::select($optimizeQuery, $params))->groupBy($groupBy);
            // dd($studentAttendanceData);

            $selectedCourse = $courseId[0] == '0' || count($courseId) > 1 ? '0' : Course::find($courseId[0]);
        }

        $data = [
            'courses' => $courses,
            'attendanceData' => $attendanceData,
            'studentAttendanceData' => $studentAttendanceData,
            'startDate' => $startDate,
            'endDate' => $endDate,
            'dates_array' => $dates,
            'report_type' => $request->get('report_type'),
            'dates' => $request->get('dates'),
            'selectedCourse' => $selectedCourse ?? '0',
            'selectedDailyOption' => $request->get('daily'),
            'virtualQuery' => $virtualQuery ?? [],
            'virtual_week' => $validated['virtual_week'] ?? [],
        ];