backend/app/Http/Controllers/AdminController.php

select `courses`.`course_name`, count(*) as total from `users` left join `courses` on `users`.`registered_course` = `courses`.`id` where `registered_course` is not null group by `courses`.`course_name`
---
    public function index()
    {
        $user_count = User::count();
        $shortlist_count = User::where('shortlist', 1)->count();
        $admin_count = Admin::count();
        $user_admission_count = UserAdmission::whereNotNull('session')->count();
        $programe_count = Programme::count();

        $studentsPerRegion = DB::table('users')
            ->join('courses', 'users.registered_course', '=', 'courses.id')
            ->join('centres', 'courses.centre_id', '=', 'centres.id')
            ->join('branches', 'centres.branch_id', '=', 'branches.id')
            ->select('branches.title as region', DB::raw('count(*) as total'))
            ->whereNotNull('users.registered_course')
            ->groupBy('branches.title')
            ->get();

        $studentsPerCourse = User::select('courses.course_name', DB::raw('count(*) as total'))->leftJoin('courses', 'users.registered_course', '=', 'courses.id')->whereNotNull('registered_course')->groupBy('courses.course_name')->get();

        $studentsPerCourse = $studentsPerCourse->map(function ($item) {
            $parts = explode(' - ', $item->course_name);
            $item->display_name = $parts[0];
            return $item;
        });

select * from `courses`
---
    public function getReportView()
    {
        $courses = Course::all();