app/Http/Controllers/AdminController.php

select * from `courses`
---
    public function registered_students()
    {
        $data['users'] = User::select('users.*', 'user_admission.id as admitted', 'courses.course_name', 'course_sessions.name as session_name', 'user_admission.session as session_id', 'courses.id as course_id')->leftJoin('user_admission', 'users.userId', '=', 'user_admission.user_id')->leftJoin('courses', 'user_admission.course_id', '=', 'courses.id')->leftJoin('course_sessions', 'user_admission.session', '=', 'course_sessions.id')->paginate(15);
        $courses = Course::all();

select * from `courses`
---
    public function generateReport(Request $request)
    {
        $validated = $request->validate([
            'report_type' => 'required|in:student_summary,course_summary,session_summary',
            'dates' => 'required',
            'course_id' => 'sometimes|array',
            'daily' => 'sometimes|in:yes,no',
            'course_id.*' => 'numeric|min:0',
            'virtual_week' => 'sometimes|array',
            'virtual_week.*' => 'numeric|min:1|max:54',
        ]);

        $startDate = Carbon::parse(explode(' - ', $request->dates)[0]);
        $endDate = Carbon::parse(explode(' - ', $request->dates)[1]);

        $dates = $this->getWeekdays($startDate, $endDate);

        $courses = Course::all();
        $selectedCourse = null;
        $studentAttendanceData = collect();
        $attendanceData = collect();

        $dailyQuery = isset($validated['daily']) && $validated['daily'] == 'yes';

        if (!Str::startsWith($request->get('report_type'), 'student')) {
            // find students that have attendance for the selected dates
            $viewName = $request->get('report_type') == 'course_summary' ? COURSE_ATTENDANCE_VIEW : COURSE_SESSION_ATTENDANCE_VIEW;
            $groupByName = $request->get('report_type') == 'course_summary' ? 'course_name' : 'session_name';
            $groupKey = $request->get('report_type') == 'course_summary' ? 'course_id' : 'session_id';

            $selectName = $request->get('report_type') == 'course_summary' ? 'v1.course_name as name' : 'v1.session_name as name';

select * from `courses` where `courses`.`id` = '25' limit 1
---
            $studentAttendanceData = collect(DB::select($optimizeQuery, $params))->groupBy($groupBy);
            // dd($studentAttendanceData);

            $selectedCourse = $courseId[0] == '0' || count($courseId) > 1 ? '0' : Course::find($courseId[0]);