app/Http/Controllers/AdminController.php

    public function index()
    {
        $user_count = User::count();
        $shortlist_count = User::where('shortlist', 1)->count();
        $admin_count = Admin::count();
        $user_admission_count = UserAdmission::whereNotNull('session')->count();
        $programe_count = Programme::count();

        $studentsPerRegion = DB::table('users')
            ->join('courses', 'users.registered_course', '=', 'courses.id')
            ->select('courses.location as region', DB::raw('count(*) as total'))
            ->whereNotNull('users.registered_course')
            ->groupBy('courses.location')
            ->get();

        $studentsPerCourse = User::select('courses.course_name', DB::raw('count(*) as total'))
            ->leftJoin('courses', 'users.registered_course', '=', 'courses.id')
            ->whereNotNull('registered_course')
            ->groupBy('courses.course_name')
            ->get();

        $studentsPerCourse = $studentsPerCourse->map(function ($item) {
            $parts = explode(" - ", $item->course_name);
            $item->display_name = $parts[0];
            return $item;
        });

        $registrationsPerDay = User::select(DB::raw('DATE(created_at) as date'), DB::raw('count(*) as total'))
            ->groupBy('date')
            ->orderBy('date', 'asc')
            ->limit(30)
            ->get();

        $genderDistribution = User::select('gender', DB::raw('count(*) as total'))
            ->whereNotNull('gender')
            ->groupBy('gender')
            ->get();

        $ageGroups = User::select(
            DB::raw('CASE
                               WHEN age BETWEEN 15 AND 19 THEN "15-19"
                               WHEN age BETWEEN 20 AND 24 THEN "20-24"
                               WHEN age BETWEEN 25 AND 35 THEN "25-35"
                               WHEN age BETWEEN 36 AND 45 THEN "36-45"
                               WHEN age >= 45 THEN "45+"
                               ELSE "Unknown"
                            END as age_group'),
            DB::raw('count(*) as total')
        )
            ->groupBy('age_group')
            ->orderBy(DB::raw('MIN(age)'))
            ->get();
---
select count(*) as aggregate from `users`
select count(*) as aggregate from `users` where `shortlist` = 1
select count(*) as aggregate from `admins`
select count(*) as aggregate from `programmes`
select `courses`.`location` as `region`, count(*) as total from `users` inner join `courses` on `users`.`registered_course` = `courses`.`id` where `users`.`registered_course` is not null group by `courses`.`location`
select `courses`.`course_name`, count(*) as total from `users` left join `courses` on `users`.`registered_course` = `courses`.`id` where `registered_course` is not null group by `courses`.`course_name`
select DATE(created_at) as date, count(*) as total from `users` group by `date` order by `date` asc limit 30
select `gender`, count(*) as total from `users` where `gender` is not null group by `gender`
select CASE
WHEN age BETWEEN 15 AND 19 THEN "15-19"
WHEN age BETWEEN 20 AND 24 THEN "20-24"
WHEN age BETWEEN 25 AND 35 THEN "25-35"
WHEN age BETWEEN 36 AND 45 THEN "36-45"
WHEN age >= 45 THEN "45+"
ELSE "Unknown"
END as age_group, count(*) as total from `users` group by `age_group` order by MIN(age) asc

    public function shortlisted_students(Request $request)
    {
        $data['exam'] = Oex_exam_master::all();
        $data['exams'] = Oex_exam_master::where('status', '1')->get()->toArray();
        $data['courses'] = Course::pluck('course_name', 'id')->toArray();
        $data['sessions'] = CourseSession::all();
---
select * from `course_sessions`

    public function viewAttendanceByDate(Request $request)
    {
        // $courses = auth('admin')->user()->assignedCourses()->get();
        $courses = Course::myAssignedCourses()->get();
---
select * from `courses`

            }
        }

        return view('admin.view_attendance', [
            'courses' => $courses,
            'attendance' => $attendance,
            'selectedCourse' => $selectedCourse,
            'selectedDate' => $selectedDate,
            'sessions' => $sessions,
            'groupedCourses' => $courses->groupBy('location'),
            'selectedSessions' => $selectedSessions ?? []
        ]);
---
select * from `courses`

    public function getReportView()
    {
        $courses = Course::all();
---
select * from `courses`

    public function generateReport(Request $request)
    {
        $validated = $request->validate([
            'report_type' => 'required|in:student_summary,course_summary',
            'dates' => 'required',
            'course_id' => 'sometimes|array',
            'daily' => 'sometimes|in:yes,no',
            'course_id.*' => 'numeric|min:0',
            'virtual_week' => 'sometimes|array',
            'virtual_week.*' => 'numeric|min:1|max:54',
        ]);

        $startDate = Carbon::parse(explode(' - ', $request->dates)[0]);
        $endDate = Carbon::parse(explode(' - ', $request->dates)[1]);

        $dates = $this->getWeekdays($startDate, $endDate);

        $courses = Course::all();
---
select * from `courses`

            $studentAttendanceData = collect(DB::select($optimizeQuery, $params))->groupBy($groupBy);
            // dd($studentAttendanceData);

            $selectedCourse = $courseId[0] == '0' || count($courseId) > 1 ? '0' : Course::find($courseId[0]);
---
select * from `courses` where `courses`.`id` = '25' limit 1